app/Models/TaskModel.php

    public function getTasks()
    {
        return $this->db->table('tasks')
            ->select('
                tasks.*,
                personen.vorname,
                personen.name,
                taskarten.taskart,
                taskarten.taskartenicon,
                spalten.spalte,
                spalten.spaltenbeschreibung,
                spalten.boards_id,
                spalten.sort_id
            ')
            ->join('personen', 'personen.personen_id = tasks.personen_id')
            ->join('taskarten', 'taskarten.taskarten_id = tasks.taskarten_id')
            ->join('spalten', 'spalten.spalten_id = tasks.spalten_id')
            ->where('tasks.geloescht', 0)
            ->orderBy('spalten.sort_id', 'ASC')
            ->orderBy('tasks.tasks', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `tasks`.*, `personen`.`vorname`, `personen`.`name`, `taskarten`.`taskart`, `taskarten`.`taskartenicon`, `spalten`.`spalte`, `spalten`.`spaltenbeschreibung`, `spalten`.`boards_id`, `spalten`.`sort_id` as `spalten_sort_id`
FROM `tasks`
JOIN `personen` ON `personen`.`personen_id` = `tasks`.`personen_id`
JOIN `taskarten` ON `taskarten`.`taskarten_id` = `tasks`.`taskarten_id`
JOIN `spalten` ON `spalten`.`spalten_id` = `tasks`.`spalten_id`
WHERE `tasks`.`geloescht` = 0
ORDER BY `spalten`.`sort_id` ASC, `tasks`.`tasks` ASC